
## :x: Apply Failed (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/69325)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/ParserGraphQLWrapper-Prod/ecs/aws-otel-collector]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_region.region: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_caller_identity.caller: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=parsergraphqlwrapper-prod-app]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1037197018]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/800ae290-e5eb-497a-97b5-c5a7b45b85c3]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=ce282ed7-976c-4ce4-b66b-2e43f4e74269:ParserGraphQLWrapper-Prod-ECS]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 1s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z09729333DEBNF2PLBO96]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 1s [id=996905175585]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ParserGraphQLWrapper-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ParserGraphQLWrapper-Prod/ecs/app]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ParserGraphQLWrapper-Prod]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_sns_topic.backend_notifications: Read complete after 1s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ParserGraphQLWrapper-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_kms_alias.kms_alias: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ParserGraphQLWrapper-Prod-TaskRolePolicy]
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 1s [id=Z2BHWTOWFVNW3M]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=parsergraphqlwrapper-prod-app]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/b64a60b487e4e432ab06ab0f817b8397e9c8c99d]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ParserGraphQLWrapper-Prod-ECSCodeDeployRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ParserGraphQLWrapper-Prod-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ParserGraphQLWrapper-Prod-TaskExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=805263720]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z09729333DEBNF2PLBO96__6554eab671909cb74ef180d021601de9.parser-graphql-wrapper.readitlater.com._CNAME]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_parser-graphql-wrapper.readitlater.com_NS]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ParserGraphQLWrapper-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ParserGraphQLWrapper-Prod-ECSCodeDeployRole-2021011400290364180000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ParserGraphQLWrapper-Prod-TaskRole-2021011400290353710000000a]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ParserGraphQLWrapper-Prod-TaskExecutionRole-20210114002903512300000008]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2023-02-27 20:45:42.271 +0000 UTC]
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Read complete after 0s [id=PLPWYPC]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P0V77UR]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P44V86E]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ParserGraphQLWrapper-Prod-TaskExecutionRole-20210114002903529400000009]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-06bfba3c9dec9afb0]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/PARSER20210114002903429700000007/a6f71712e4a46fd5]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/PARSER20210114002903397000000005/69436690e11a4bbf]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PGMT9NU]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P5OGNS0]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 1s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 1s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 1s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 1s [id=us-east-1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P1CV9CA]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PKYE9MH]
data.aws_subnets.cache_private_subnet_ids: Reading...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-067771f97c31f2c6d]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/PARSER2021011400290430390000000c/df2267f9b6e96575]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Read complete after 1s [id=vpc-867638e3]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ParserGraphQLWrapper-Prod-Infrastructure-Alarm-Non-Critical:ec2f7832-884a-41e3-8af2-acbc4082de6e]
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Refreshing state... [id=sg-0a2986dba929a6072]
data.aws_subnets.cache_private_subnet_ids: Read complete after 0s [id=us-east-1]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Refreshing state... [id=parsergraphqlwrapper-prod-serverless]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ParserGraphQLWrapper-Prod-Infrastructure-Alarm-Critical:f21d1cda-3b88-4fce-b43c-4efd905aeab1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/PARSER2021011400290430390000000c/df2267f9b6e96575/0718661b42e48adf]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/PARSER2021011400290430390000000c/df2267f9b6e96575/78df747ef577f7b9]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=ParserGraphQLWrapper-Prod-Alarm-HTTPResponseTime]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z09729333DEBNF2PLBO96_parser-graphql-wrapper.readitlater.com_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ParserGraphQLWrapper-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/PARSER2021011400290430390000000c/df2267f9b6e96575/0718661b42e48adf/cc348fe27c0f2011]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ParserGraphQLWrapper-Prod/ParserGraphQLWrapper-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ParserGraphQLWrapper-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ParserGraphQLWrapper-Prod/ParserGraphQLWrapper-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=48927059-497e-4415-a6d0-fa686ba4abe1]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ParserGraphQLWrapper-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ParserGraphQLWrapper-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ParserGraphQLWrapper-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ParserGraphQLWrapper-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 0
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "OTLP_COLLECTOR_HOST"
                          + value = "localhost"
                        },
                      + {
                          + name  = "REDIS_IS_CLUSTER"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_IS_TLS"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_PRIMARY_ENDPOINT"
                          + value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_READER_ENDPOINT"
                          + value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 5
                      + retries     = 3
                      + startPeriod = 30
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:f6a3b2363cdd2e1bdf643885eed9f616805ee794"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4001
                          + hostPort      = 4001
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "DB_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:host::"
                        },
                      + {
                          + name      = "DB_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:password::"
                        },
                      + {
                          + name      = "DB_USERNAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:username::"
                        },
                      + {
                          + name      = "PARSER_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:parser_endpoint::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:host::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:password::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:username::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ParserGraphQLWrapper/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "SHORT_CODE_CHARS"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_code_chars::"
                        },
                      + {
                          + name      = "SHORT_PREFIX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix::"
                        },
                      + {
                          + name      = "SHORT_PREFIX_SECURE"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix_secure::"
                        },
                    ]
                  + volumesFrom            = []
                },
              + {
                  + command                = [
                      + "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  + cpu                    = 0
                  + environment            = []
                  + essential              = true
                  + image                  = "amazon/aws-otel-collector"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/aws-otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "aws-otel-collector"
                  + portMappings           = [
                      + {
                          + containerPort = 4138
                          + hostPort      = 4138
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/ParserGraphQLWrapper-Prod-TaskExecutionRole"
      + family                   = "ParserGraphQLWrapper-Prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Prod"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all                 = {
          + "environment" = "Prod"
          + "service"     = "ParserGraphQLWrapper"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/ParserGraphQLWrapper-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF will be updated in-place
  ~ resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
        id                       = "parsergraphqlwrapper-prod-serverless"
        name                     = "parsergraphqlwrapper-prod-serverless"
        tags                     = {
            "environment" = "Prod"
            "service"     = "ParserGraphQLWrapper"
        }
        # (14 unchanged attributes hidden)

      + cache_usage_limits {
          + data_storage {
              + maximum = 100
              + unit    = "GB"
            }
        }
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Modifying... [id=parsergraphqlwrapper-prod-serverless]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 1m50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m10s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m20s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m30s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m40s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 2m50s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 3m0s elapsed]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Still modifying... [id=parsergraphqlwrapper-prod-serverless, 3m10s elapsed]
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to
│ aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF,
│ provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an
│ unexpected new value: .cache_usage_limits: block count changed from 1 to 0.
│ 
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"3bc16cf4-6750-4cb4-8216-7fe7494f316f","JobName":"parser-graphql-wrapper_infrastructure_apply_prod","PRNumber":240,"Program":"tfcmt","SHA1":"f6a3b2363cdd2e1bdf643885eed9f616805ee794","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->